#+TITLE: GNU Emacs Lisp 编程入门

** 运行一个程序
在 Lisp 中的一个列表 -- 任何列表 -- 都是一个准备运行的程序.

如果你运行它(在 Lisp 的术语中, 称为 求值), 计算机将完成三件事情

1. 只返回列表本身
2. 告诉你一个出错的消息
3. 将列表的第一个符号当做一个命令, 然后执行这个命令

单引号(') 被称作 引用(quote) 

当单引号位于一个列表之前时, 它告诉 Lisp 不要对这个列表做任何操作, 而仅仅按其原样

如果一个列表前面没有引号, 这个列表的第一个符号就很特别了: 它是一条计算机要执行的命令(在 Lisp 中, 被称为函数)

#+BEGIN_SRC elisp
(+ 2 2)
#+END_SRC

#+RESULTS:
: 4

Lisp 解释器 能将 人 能理解的表达式 翻译成 计算机的语言

*** 使用 set 函数
#+BEGIN_SRC elisp
(set 'flowers '(rose violet daisy buttercup))
#+END_SRC

#+RESULTS:
| rose | violet | daisy | buttercup |

** 缓冲区名

#+BEGIN_SRC elisp
(buffer-name)
#+END_SRC

#+RESULTS:
: gnu-emacs-lisp.org

#+BEGIN_SRC elisp
(buffer-file-name)
#+END_SRC

#+RESULTS:
: /Users/zhenyuanlau/.spacemacs.d/katas/gnu-emacs-lisp.org

文件和缓冲区是两个不同的实体.

文件是永久记录在计算机中的信息; 缓冲区是 Emacs 内部的信息, 在 Emacs 编辑会话结束时就消失了

缓冲区是一个中间部件, 一个临时存放区, 计算机的工作就是在这里进行的.


并不是所有的缓冲区都与文件关联在一起. *scratch* *help*

** 获得缓冲区

#+BEGIN_SRC elisp
(current-buffer)
#+END_SRC

#+RESULTS:
: #<buffer gnu-emacs-lisp.org>

buffer-name 函数返回缓冲区的名字; current-buffer 返回缓冲区本身

一个名字与名字所指的对象或实体是互不相同的. 你不是你的名字, 你是用名字指向的人.

#+BEGIN_SRC elisp
(other-buffer)
#+END_SRC

#+RESULTS:
: #<buffer *scratch*>

** 切换缓冲区
#+BEGIN_SRC elisp
(switch-to-buffer (other-buffer))
#+END_SRC

#+RESULTS:
: #<buffer *scratch*>

当对第一个元素是一个函数的列表求值时, 就是在调用那个函数.

** 缓冲区大小和位点的定位
#+BEGIN_SRC elisp
(buffer-size)
#+END_SRC

#+RESULTS:
: 4106

#+BEGIN_SRC elisp
(point)
#+END_SRC

#+RESULTS:
: 4152

#+BEGIN_SRC elisp
(point-min)
#+END_SRC

#+RESULTS:
: 1

#+BEGIN_SRC elisp
(point-max)
#+END_SRC

#+RESULTS:
: 4279

** car / cdr
一个列表的 car, 简单地说, 返回这个列表的第一个元素.

#+BEGIN_SRC elisp
(car '(rose violet daisy buttercup))
#+END_SRC

#+RESULTS:
: rose

car 是 非破坏性的, 不将第一个元素从列表中移走, 仅仅报告列表的第一个元素是什么.

一个列表的 cdr 就是这个列表的其余部分(除第一个元素以外的其余部分)

#+BEGIN_SRC elisp
(cdr '(rose violet daisy buttercup))
#+END_SRC

#+RESULTS:
| violet | daisy | buttercup |

car <=> first / cdr <=> rest

** cons

cons 必须有一个待插入元素的列表. cons 将一个新元素放到一个列表的开始处

#+BEGIN_SRC elisp
(setq flowers ())
(cons 'rose flowers)
#+END_SRC

#+RESULTS:
| rose |

** nthcdr
#+BEGIN_SRC elisp
(nthcdr 2 '(rose violet daisy buttercup))
#+END_SRC

#+RESULTS:
| daisy | buttercup |

** setcar
#+BEGIN_SRC elisp
(setq animals '(giraffe antelope tiger lion))
(setcar animals 'hippopotamus)
animals
#+END_SRC

#+RESULTS:
| hippopotamus | antelope | tiger | lion |

** setcdr

#+BEGIN_SRC elisp
(setq domesticated-animals '(horse cow sheep goat))
(setcdr domesticated-animals '(cat dog))
domesticated-animals
#+END_SRC

#+RESULTS:
| horse | cat | dog |

** 练习
#+BEGIN_SRC elisp
(setq plants '(fir oak maple))
(setq plants (cons 'pine plants))
plants
#+END_SRC

#+RESULTS:
| pine | fir | oak | maple |

